In [1]:
import pandas as pd
import sqlite3

In [12]:
con = sqlite3.connect('dataset/matches.sqlite')
match = pd.read_sql('SELECT * FROM match WHERE league_id==10257', con)
con.close()
match = match.iloc[:, :11]

kernel = match.iloc[:, [7,8,9,10]]
kernel.sample(5)

      home_team_api_id  away_team_api_id  home_team_goal  away_team_goal
3003              9875              8535               2               1
2083              8529              8543               0               2
2826             10233              8600               2               1
2455              7943             10167               4               1
1795              9857              9875               0               3